{
    "Health": {
        "1": {"Numerology": "Numerology: Your names are a friction; you're on different frequencies.", "Astrology": "Astrology: Your signs naturally friction; plans feel like hard work.", "Palmistry": "Palmistry: Your physical 'batteries' friction each other; energy feels drained."},
        "95": {"Numerology": "Numerology: Your names share a natural current; you 'get' each other.", "Astrology": "Astrology: Your signs are in a current 'sweet spot' that feels easy.", "Palmistry": "Palmistry: Your energy levels share a current; you'll want to be active at the same times."}
    },
    "Power": {
        "1": {"Numerology": "Numerology: Ambition clash detected; your numeric paths are crossing.", "Astrology": "Astrology: Planetary tension makes leadership decisions difficult.", "Palmistry": "Palmistry: Your biometric power signatures are currently in opposition."},
        "95": {"Numerology": "Numerology: Your name vibrations build a massive shared authority.", "Astrology": "Astrology: A rare cosmic bridge empowers your joint ventures.", "Palmistry": "Palmistry: Biometric energy shows you lead best when side-by-side."}
    },
    "Creativity": {
        "1": {"Numerology": "Numerology: Your names are a friction; you're on different frequencies.", "Astrology": "Astrology: Your signs naturally friction; plans feel like hard work.", "Palmistry": "Palmistry: Your physical 'batteries' friction each other; energy feels drained."},
        "95": {"Numerology": "Numerology: Your names share a natural current; you 'get' each other.", "Astrology": "Astrology: Your signs are in a current 'sweet spot' that feels easy.", "Palmistry": "Palmistry: Your energy levels share a current; you'll want to be active at the same times."}
    },
    "Social": {
        "1": {"Numerology": "Numerology: Public image mismatch; frequencies are misaligned.", "Astrology": "Astrology: Your signs create social static in group settings.", "Palmistry": "Palmistry: Bio-signatures suggest differing needs for social space."},
        "95": {"Numerology": "Numerology: Your names share a natural sync; you 'get' each other.", "Astrology": "Astrology: Your signs are in a sync 'sweet spot' that feels easy.", "Palmistry": "Palmistry: Your energy levels share a sync; you'll want to be active at the same times."}
    },
    "Emotional": {
        "1": {"Numerology": "Numerology: Inner self friction; your core numbers feel heavy together.", "Astrology": "Astrology: Moon-sign tension makes emotional safety hard to reach.", "Palmistry": "Palmistry: Heart-line variance suggests very different feeling languages."},
        "95": {"Numerology": "Numerology: Your core resonance creates an effortless emotional bond.", "Astrology": "Astrology: Sun signs share a rare harmony that validates every feeling.", "Palmistry": "Palmistry: Biometrics show a deep physical calm when you are together."}
    },
    "Mental": {
        "1": {"Numerology": "Numerology: Thought-process clash; communication feels like a maze.", "Astrology": "Astrology: Intellectual signs are squared; debates become draining.", "Palmistry": "Palmistry: Head-line signatures show different logic frequencies."},
        "95": {"Numerology": "Numerology: You finish each other's thoughts; the vibrations match.", "Astrology": "Astrology: Your signs are in a logic 'sweet spot' that feels easy.", "Palmistry": "Palmistry: Brain-wave biometric sync is detected at a high level."}
    },
    "Lifestyle": {
        "1": {"Numerology": "Numerology: Daily routine friction; numeric paths are out of step.", "Astrology": "Astrology: Habit signs naturally clash; timing feels off.", "Palmistry": "Palm